cases/hydrodynamics/neuveglise-lehavre-5.0.0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
	(0 0 0)		//0
	(34 0 0)	//1
	(34 0.9 0)	//2
	(0 0.9 0)	//3	
	(34 0 0.8)	//4
	(35 0 0.8)	//5
	(35 0.9 0.8)	//6
	(34 0.9 0.8)	//7
	(0 0 1.2)	//8	
	(35 0 1.2)	//9
	(35 0.9 1.2)	//10
	(0 0.9 1.2)	//11
	(34 0 1.2)	//12
	(34 0.9 1.2)	//13
	(0 0 0.8)	//14
	(0 0.9 0.8)	//15

);

blocks
(
    hex (0 1 2 3 14 4 7 15) (1360 1 30) simpleGrading (1 1 1)
    hex (14 4 7 15 8 12 13 11) (1360 1 4) simpleGrading (1 1 1)
    hex (4 5 6 7 12 9 10 13) (20 1 4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 15 14)
	    (14 15 11 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	    (5 6 10 9)
        );
    }
    stationaryWalls
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (1 2 7 4)
            (4 5 6 7)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (8 12 13 11)
            (12 9 10 13)
        );
    }
    floatingObject
    {
        type wall;
        faces ();
    }
);

//mergePatchPairs
//(
//);

// ************************************************************************* //
