cases/hydrodynamics/neuveglise-lehavre-5.0.0/constant/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        regular;

waveTheory      cnoidal;

genAbs          0;

absDir          0.0;

nPaddles        1;

wavePeriod      15.0;

waveHeight      0.05;

waveDir         0.0;

wavePhase       0.0;

tSmooth         0.0;

// ************************************************************************* //
